# Задача 1:
# Вывести квадрат числа

num = int(input('Введите натуральное число: '))
print(f'Квадрат числа {num} -> {num**2}')
